export default {
    'basics': {
        'position': 'java开发工程师',
        'name': '汤薛宁',
        'gender': '男',
        'age': '25',
        'worklife': '3',
        'label': 'Different but not less',
        'picture': 'http://oaxfgzulv.bkt.clouddn.com/tangdatang_avatar.jpg',
        'email': '584911730@qq.com',
        'phone': '18233136948',
        'website': 'https://github.com/zincode',
        'summary': [
            '个人主攻 java后台开发方向，有一定python和linux基础。',
            '喜欢关注 java开发 相关新技术，对于新技术有很强的学习兴趣。',
            '喜欢设计代码简洁的程序',
            '热爱开发这份工作，也热爱一切美好的事物，对于我来说，是一种责任、是一种快乐。'
        ],
        'location': '北京昌平区',
        'profiles': [
            {
                'network': 'github',
                'username': '',
                'url': 'https://github.com/ZinCode'
            }
            
        ]
    },
    'work': [
	{
            'company': '北京和鸿盈科科技有限公司',
            'position': 'java开发工程师',
            'website': '',
            'startDate': '2017-06',
            'endDate': '至今',
            'summary': '北京和鸿盈科科技有限公司',
            'highlights': [
                '联通科研项目备案及评估系统维护及二次开发', 
                '联通分公司结算评奖系统',
                '完成后台接口设计与编写'
            ]
        },
        {
            'company': '北京水木元生科技有限公司',
            'position': 'java开发工程师',
            'website': '',
            'startDate': '2016-03',
            'endDate': '2017-05',
            'summary': '北京水木元生科技有限公司',
            'highlights': [
                '健康一体机系统', 
                '软硬件接口交互开发',
                '服务器部署及调试',
                '开发健康一体机自更新软件',
                '负责配合前端开发人员，完成页面的交互及接口对接'
            ]
        },
	
            'company': '河北圣诺联合科技有限公司',
            'position': 'java开发工程师',
            'website': '',
            'startDate': '2015-06',
            'endDate': '2016-01',
            'summary': '河北圣诺联合科技有限公司',
            'highlights': [
                '电子招投标开发组', 
                '使用ssm框架编写招投标业务逻辑',
                '负责招标网站功能模块及后台管理系统的设计',
                '负责配合测试人员，进行页面和接口测试'
            ]
        },
    ],
    'project': [
        {
            'organization': '招投标网站、招投标后台业务管理',
            'position': java开发工程师',
            'website': '',
            'startDate': '2015.09',
            'endDate': '2016.01',
            'summary': 'Eclipse + tomcat + jsp+ easyUI + Oracle',
            'highlights': [
                '基于 easyUI 前端框架开发，使界面更简洁，提升用户体验',
                '采用MVC分层架构，使业务逻辑更简明，提高复用性',
                '使用PowerDesigner进行数据建模，优化数据库逻辑关系',
                '熟悉linux，能进行项目服务部署'
            ]
        },
        {
            'organization': '健康一体机系统',
            'position': 'java开发工程师',
            'website': '',
            'startDate': '2016.04',
            'endDate': '2017.04',
            'summary': 'IDEA+SSM+MySQL+RPC、Redis、angularJs、Python+mongoDB',
            'highlights': [
                '基于SSM框架开发，提升运行效率，熟练使用分布式RPC框架',
                '网站开发使用angularJS，双向数据绑定使界面更友好',
                '使用Python爬取大量中医相关数据，方便与一体机测量数据做分析',
 		'软硬件接口交互开发',
		'熟练Redis应用，熟悉缓存击穿和缓存崩溃',
            ]
        },
        {
            'organization': '联通科研项目备案及评估系统',
            'position': 'java开发工程师',
            'website': '',
            'startDate': '2017.10',
            'endDate': '至今',
            'summary': 'IDEA+Tomcat+Hibernate+Oracle',
            'highlights': [
                '基于已有工作流进行二次开发，根据客户需求对系统进行扩展和修改',
                '代码测试及服务器部署',
                '抽离公共组件，增强代码复用性'
            ]
        }
    ],
    'education': [
        {
            'institution': '河北科技大学',
            'area': '计算机技术',
            'studyType': '本科',
            'startDate': '2011-09',
            'endDate': '2015-06',
            'gpa': '4.0',
            'courses': [
                
            ]
        }
    ],
    'awards': [
        {
            'title': '全国计算机二级证书',
            'date': '2013-11-01',
            'awarder': '教育部考试中心',
            'summary': ''
        }
    ],
   
    'skills': [
        {
            'name': '前端',
            'level': 'master',
            'keywords': [
                'HTML',
                'CSS',
                'Javascript',
                'angularJs',
                'Webpack',
            ]
        },
        {
            'name': '后端',
            'level': 'master',
            'keywords': [
                'java',
                'SSM',
                'RPC',
		'MySQL',
		'ORACLE',
		'PYTHON',
                'REDIS'
            ]
        }
    ],
    'languages': [
        {
            'language': '中文',
            'fluency': '母语'
        }
    ],
    'interests': [
        {
            'name': '社交',
            'keywords': [
                '知乎',
                '微信',
            ]
        },{
            'name': '爱好',
            'keywords': [
                '骑行脑残粉',
                '会修电脑😄'
            ]
        }
    ],
    'references': [
        {
            'name': '鲁迅（我确实说过这句话）',
            'reference': '没事儿就多喝水'
        }
    ]
}
